app/views/users/show.html.erb

    </div>
    <p class="username"><%= @user.posts.count %> Posts</p>
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 2], ["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 2]]

  <%= link_to post_path(post) do %>
    <% if post.photos.size == 1 %>
---
SELECT  "photos".* FROM "photos" WHERE "photos"."post_id" = ? ORDER BY "photos"."id" ASC LIMIT ?  [["post_id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "photos" WHERE "photos"."post_id" = ?  [["post_id", 2]]