app/views/posts/_photos.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."post_id" IN (2, 1)
---
<%= link_to post_path(post) do %>
  <% if post.photos.size == 1 %>