app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" ORDER BY created_at desc LIMIT ?  [["LIMIT", 10]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN (2, 1) ORDER BY "likes"."created_at" DESC
SELECT "photos".* FROM "photos" WHERE "photos"."post_id" IN (2, 1)
SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 1)
---
  def index
    @posts = Post.all.includes(:photos, :user, :likes).order_created_desc.limit(10)

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Ahihi"], ["user_id", 1], ["created_at", "2018-12-14 04:01:22.284302"], ["updated_at", "2018-12-14 04:01:22.284302"]]
INSERT INTO "photos" ("image", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["image", "unnamed.jpg"], ["post_id", 1], ["created_at", "2018-12-14 04:01:23.699970"], ["updated_at", "2018-12-14 04:01:23.699970"]]
---
  def create
    @post = current_user.posts.build(post_params)
    if @post.save
      if params[:images]
        params[:images].each do |img|
          @post.photos.create(image: params[:images][img])

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]
---
  def destroy
    if @post.user == current_user
      if @post.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def load_post
    @post = Post.find_by id: params[:id]