app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."public" = ?  [["public", 1]]
---
    def index
      @rooms = Room.where(:public => true)

INSERT INTO "rooms" ("title", "user_id", "public", "created_at", "updated_at", "session_id") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
      session = @opentok.create_session
      params[:room][:session_id] = session.session_id

      @room = current_user.rooms.build(room_params)

      respond_to do |format|
        if @room.save

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 1]]
---
    def destroy
      @room = Room.find_by id: params[:id]
      @room.destroy

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def party
      @room = Room.find(params[:id])