app/controllers/streams_controller.rb

SELECT "streams".* FROM "streams"
---
    def index
      @streams = Stream.all

INSERT INTO "streams" ("user_id", "title", "session_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
    def create
        session = session = @opentok.create_session
        params[:stream][:session_id] = session.session_id
        @new_stream = current_user.streams.build(stream_params)
        # @new_post.session_id = session.session_id

      respond_to do |format|
        if @new_stream.save

SELECT  "streams".* FROM "streams" WHERE "streams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "streams" WHERE "streams"."id" = ?  [["id", 1]]
---
    def destroy
      @stream = Stream.find_by id: params[:id]
      if @stream.destroy

SELECT  "streams".* FROM "streams" WHERE "streams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
      @stream = Stream.find_by id: params[:id]